In [5]:
import numpy as np
import pandas as pd

In [6]:
Bankdata=pd.read_csv('Datahtml.csv',index_col=0)
Bankdata

,Rank,Bank name,Total assets (2023) (US$ billion)
0,1,Industrial and Commercial Bank of China,6303.44
1,2,Agricultural Bank of China,5623.12
2,3,China Construction Bank,5400.28
3,4,Bank of China,4578.28
4,5,JPMorgan Chase,3875.39
...,...,...,...
95,96,Handelsbanken,351.79
96,97,Industrial Bank of Korea,345.81
97,98,DNB,339.21
98,99,Qatar National Bank,338.14
99,100,VTB Bank,326.85

In [7]:
Bankdata.head()

,Rank,Bank name,Total assets (2023) (US$ billion)
0,1,Industrial and Commercial Bank of China,6303.44
1,2,Agricultural Bank of China,5623.12
2,3,China Construction Bank,5400.28
3,4,Bank of China,4578.28
4,5,JPMorgan Chase,3875.39

In [8]:
Bankdata.tail()

    Rank                 Bank name  Total assets (2023) (US$ billion)
95    96             Handelsbanken                             351.79
96    97  Industrial Bank of Korea                             345.81
97    98                       DNB                             339.21
98    99       Qatar National Bank                             338.14
99   100                  VTB Bank                             326.85

In [9]:
Bankdata.info()

<class 'pandas.core.frame.DataFrame'>
Index: 100 entries, 0 to 99
Data columns (total 3 columns):
 #   Column                             Non-Null Count  Dtype
---  ------                             --------------  -----
 0   Rank                               100 non-null    int64
 1   Bank name                          100 non-null    object
 2   Total assets (2023) (US$ billion)  100 non-null    float64
dtypes: float64(1), int64(1), object(1)
memory usage: 3.1+ KB

In [10]:
#single row
row5=Bankdata.loc[5]
bankname

NameError: name 'bankname' is not defined

In [ ]:
#single column
bankrank=Bankdata.Rank
bankrank

In [ ]:
bankrank=Bankdata.loc[:,['Bank name','Rank']]
bankrank

In [ ]:
multirow=Bankdata.iloc[[0,5,8,12]]
multirow

In [ ]:
Bestbank=Bankdata[Bankdata['Total assets (2023) (US$ billion)']>5000.00]
print(f"Banks with assets greater than 5000 billion are {Bestbank}")

In [12]:
bd=Bankdata.rename(columns={'Total assets (2023) (US$ billion)':'assets'})
bd

    Rank                                Bank name   assets
0      1  Industrial and Commercial Bank of China  6303.44
1      2               Agricultural Bank of China  5623.12
2      3                  China Construction Bank  5400.28
3      4                            Bank of China  4578.28
4      5                           JPMorgan Chase  3875.39
..   ...                                      ...      ...
95    96                            Handelsbanken   351.79
96    97                 Industrial Bank of Korea   345.81
97    98                                      DNB   339.21
98    99                      Qatar National Bank   338.14
99   100                                 VTB Bank   326.85

[100 rows x 3 columns]

In [13]:
mean_assets=bd['assets'].mean()
print(f"Mean assets of all banks in billions {mean_assets}")

Mean assets of all banks in billions 1175.9259000000002

In [14]:
std_assets=bd['assets'].std()
print(f"Mean std deviation of assets of all banks in billions {std_assets}")

Mean std deviation of assets of all banks in billions 1153.6201569377683

In [16]:
bd.shape

(100, 3)

In [17]:
bd.size

300

In [18]:
bd.isnull().sum()

Rank         0
Bank name    0
assets       0
dtype: int64